app/controllers/account_controller.rb

def create
  if request.post? and params[:user]
    @user = Usuario.new(params[:user])

    user = Usuario.find_by_user(@user.user)

    # If we found a user with that username and the password provided matches
    # the password on file for that user, we can login the user.
    if user and user.password==@user.password
      session[:user_id] = user.id
      session[:current_user_id] = user.id
      user.last_login = Time.now
      user.save
---
SELECT * FROM `usuarios` WHERE (`usuarios`.`user` = 'testUser') LIMIT 1
UPDATE `usuarios` SET `updated_at` = '2013-08-02 15:03:25', `last_login` = '2013-08-02 15:03:25' WHERE `id` = 1