app/controllers/filtros_controller.rb

  def index
    @filtros = Filtro.all
---
SELECT * FROM `filtros`

  def show
    @filtro = Filtro.find(params[:id])
---
SELECT * FROM `filtros` WHERE (`filtros`.`id` = 340)

  def edit
    @filtro = Filtro.find(params[:id])
---
SELECT * FROM `filtros` WHERE (`filtros`.`id` = 340)