app/controllers/indices_controller.rb

SELECT * FROM `tipo_vehiculos` WHERE (`tipo_vehiculos`.`id` = 2)
SELECT distinct marca FROM `vehiculos` WHERE (tipo = 2)
SELECT * FROM `tipo_vehiculos` ORDER BY nombre asc
SELECT * FROM `marca_vehiculos` WHERE (id in (46,65,66,67,68,69,70,71,72,73,4,47,74,75,76,77,78,10,7,79,80,55,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,44))
---
  def tipo_vehiculo
   filter_data

   @tipo_vehiculo= TipoVehiculo.find(params[:id])
   @vehiculos=Vehiculo.find(:all,:select=>"distinct marca",:conditions=>"tipo = " + params[:id])
   @marcas_map=Hash.new

   if @vehiculos.length > 0
      marcas= MarcaVehiculo.find(:all,:conditions=>"id in (" + @vehiculos.map{|a| a.marca}.join(",") + ")",:order=>"nombre asc")

SELECT * FROM `tipo_vehiculos` WHERE (`tipo_vehiculos`.`id` = 4)
SELECT * FROM `vehiculos` WHERE (marca = 2 and tipo = 2) ORDER BY modelo asc
SELECT * FROM `marca_vehiculos` WHERE (`marca_vehiculos`.`id` = 8) ORDER BY nombre asc
SELECT * FROM `tipo_vehiculos` ORDER BY nombre asc
---
  def marca_vehiculo
   filter_data

    if !params[:brand_v]
      params[:brand_v]=params[:id]
    end
   vehiculos=Vehiculo.find(:all,:conditions=>"marca = " + (params[:brand_v] + " and tipo = " + params[:type_v]),:order=>"modelo asc")
   @marca_vehiculo= MarcaVehiculo.find(params[:brand_v],:order=>"nombre asc")
   @tipo_vehiculo= TipoVehiculo.find(params[:type_v])

  @vehiculos_map=Hash.new

   vehiculos.each do |a_brand|

SELECT * FROM `tipo_vehiculos` WHERE (`tipo_vehiculos`.`id` = 4)
SELECT * FROM `vehiculos` WHERE (`vehiculos`.`id` = 2244)
SELECT * FROM `marca_vehiculos` WHERE (`marca_vehiculos`.`id` = 1) ORDER BY nombre asc
SELECT * FROM `filtros` WHERE (id in (348,738)) ORDER BY codigo asc
SELECT filtro FROM `filtro_vehiculos` WHERE (vehiculo = 2249)
SELECT * FROM `tipo_filtros` ORDER BY nombre asc
SELECT * FROM `tipo_vehiculos` ORDER BY nombre asc
---
  def modelo_vehiculo
   filter_data

    if !params[:model_v]
      params[:model_v]=params[:id]
    end

   @modelo_vehiculo=Vehiculo.find(params[:model_v])
   @marca_vehiculo= MarcaVehiculo.find(params[:brand_v],:order=>"nombre asc")
   @tipo_vehiculo= TipoVehiculo.find(params[:type_v])
   tipos_filtros= TipoFiltro.find(:all)

   filtro_vehiculo=FiltroVehiculo.find(:all,:select=>:filtro,:conditions=>"vehiculo = " + params[:model_v]).map { |e| e.filtro }
   if filtro_vehiculo.length > 0

SELECT * FROM `tipo_vehiculos` WHERE (`tipo_vehiculos`.`id` = 4)
SELECT * FROM `vehiculos` WHERE (`vehiculos`.`id` = 2362)
SELECT * FROM `marca_vehiculos` WHERE (`marca_vehiculos`.`id` = 2) ORDER BY nombre asc
SELECT * FROM `tipo_filtros` WHERE (`tipo_filtros`.`id` = 1)
SELECT filtro FROM `filtro_vehiculos` WHERE (vehiculo = 2362)
SELECT * FROM `tipo_filtros` ORDER BY nombre asc
SELECT * FROM `tipo_vehiculos` ORDER BY nombre asc
SELECT * FROM `alternativos` WHERE (primario=848 or secundario=848)
---
  def filtro
   filter_data

    if !params[:filtro]
      params[:filtro]=params[:id]
    end

   @modelo_vehiculo=Vehiculo.find(params[:model_v])
   @marca_vehiculo= MarcaVehiculo.find(params[:brand_v],:order=>"nombre asc")
   @tipo_vehiculo= TipoVehiculo.find(params[:type_v])

   filtro_vehiculo=FiltroVehiculo.find(:all,:select=>:filtro,:conditions=>"vehiculo = " + params[:model_v]).map { |e| e.filtro }

   @filtro = Filtro.find(params[:filtro])
   @tipo_filtro= TipoFiltro.find(@filtro.tipo)

   aplicaciones=FiltroVehiculo.find(:all,:select=>:vehiculo,:conditions=>"filtro = " + params[:filtro]).map { |e| e.vehiculo }
   @aplicaciones_map=Hash.new

   aplicaciones.each do |a_aplic|
     modelo_vehiculo=Vehiculo.find(a_aplic)

     marca= MarcaVehiculo.find(modelo_vehiculo.marca,:order=>"nombre asc")
     @aplicaciones_map["/indices/modelo_vehiculo/"+modelo_vehiculo.id.to_s+"?type_v="+modelo_vehiculo.tipo.to_s+"&brand_v="+modelo_vehiculo.marca.to_s]=     marca.nombre + " " + (modelo_vehiculo.modelo||"") + " " + (modelo_vehiculo.desde && !modelo_vehiculo.desde.empty? ? "Desde #{modelo_vehiculo.desde}" : "") + " " + (modelo_vehiculo.hasta && !modelo_vehiculo.hasta.empty? ? "Hasta #{modelo_vehiculo.hasta}" : "")
   end
   alternativos = Alternativo.find(:all,:conditions=>"primario=#{params[:filtro]} or secundario=#{params[:filtro]}")

SELECT * FROM `equivalencias` WHERE (filtro = 392)
---
       @alternativos_map["/indices/filtro_alt/#{a_alter.primario}"]="Primario #{filtro.codigo}"
     end
   end
   equivalencias = Equivalencia.find(:all,:conditions=>"filtro = " + params[:filtro])

SELECT * FROM `tipo_filtros` WHERE (`tipo_filtros`.`id` = 4)
SELECT * FROM `vehiculos` WHERE (`vehiculos`.`id` = 1337)
SELECT vehiculo FROM `filtro_vehiculos` WHERE (filtro = 1113)
SELECT * FROM `tipo_filtros` ORDER BY nombre asc
SELECT * FROM `tipo_vehiculos` ORDER BY nombre asc
SELECT * FROM `marca_vehiculos` WHERE (`marca_vehiculos`.`id` = 65) ORDER BY nombre asc
SELECT * FROM `alternativos` WHERE (primario=1113 or secundario=1113)
---
  def filtro_alt
   filter_data

    if !params[:filtro]
      params[:filtro]=params[:id]
    end

   @filtro = Filtro.find(params[:filtro])
   @tipo_filtro= TipoFiltro.find(@filtro.tipo)

   aplicaciones=FiltroVehiculo.find(:all,:select=>:vehiculo,:conditions=>"filtro = " + params[:filtro]).map { |e| e.vehiculo }
   @aplicaciones_map=Hash.new

   aplicaciones.each do |a_aplic|
     modelo_vehiculo=Vehiculo.find(a_aplic)

     marca= MarcaVehiculo.find(modelo_vehiculo.marca,:order=>"nombre asc")
     @aplicaciones_map["/indices/modelo_vehiculo/"+modelo_vehiculo.id.to_s+"?type_v="+modelo_vehiculo.tipo.to_s+"&brand_v="+modelo_vehiculo.marca.to_s]=     marca.nombre + " " + (modelo_vehiculo.modelo||"") + " " + (modelo_vehiculo.desde && !modelo_vehiculo.desde.empty? ? "Desde #{modelo_vehiculo.desde}" : "") + " " + (modelo_vehiculo.hasta && !modelo_vehiculo.hasta.empty? ? "Hasta #{modelo_vehiculo.hasta}" : "")
   end
   alternativos = Alternativo.find(:all,:conditions=>"primario=#{params[:filtro]} or secundario=#{params[:filtro]}")

SELECT * FROM `equivalencias` WHERE (filtro = 1112)
---
       @alternativos_map["/indices/filtro_alt/#{a_alter.primario}"]="Primario #{filtro.codigo}"
     end
   end
   equivalencias = Equivalencia.find(:all,:conditions=>"filtro = " + params[:filtro])

SELECT * FROM `filtros` WHERE (tipo = 2 or tipo = 164194020) ORDER BY codigo asc
SELECT * FROM `tipo_filtros` ORDER BY nombre asc
---
  def filtros_tipo
   filter_data

   tipos_filtros= TipoFiltro.find(:all)

    @filtros = Filtro.find(:all,:conditions=>"tipo = #{params[:id]} or tipo = #{tipo_filtro_relacion(tipos_filtros,params[:id])}",:order=>"codigo asc")

    @tipos_map=Hash.new

   tipos_filtros.each do |a_brand|